---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS
source: html/9a61f25d-a649-5b59-6f41-7552ab1328c6.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS

Defines parameters for parameterized rectangle HSS structural section.

## Syntax (C#)
```csharp
public class StructuralSectionRectangleHSS : StructuralSectionGeneralH
```